In [93]:
people = {
    "first_name":["Duyen le","","NaN","NaN"],
    "last_name":"huu",
    "sdt":["1","2","3","18"]
}
people2 = [{
    "first_name":"lÃª",
    "last_name":"duyen",
    "sdt":"0111223456"
}]

In [2]:
import pandas as pd
import random
import numpy as np

In [94]:
df = pd.DataFrame(people)
df2 = pd.DataFrame(people2)

In [4]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1                  huu  1234
2        NaN       huu  3456

In [5]:
df.sdt

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [6]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [7]:
df[['sdt','first_name']]

    sdt first_name
0  0123   Duyen le
1  1234
2  3456        NaN

In [8]:
df.columns

Index(['first_name', 'last_name', 'sdt'], dtype='object')

In [9]:
df.iloc[[0,1],1]

0    huu
1    huu
Name: last_name, dtype: object

In [10]:
df

  first_name last_name   sdt
0   Duyen le       huu  0123
1                  huu  1234
2        NaN       huu  3456

In [80]:
df.loc[[0,2],"sdt"]

0    0123
2    3456
Name: sdt, dtype: object

In [12]:
df.set_index('sdt',inplace=True)

In [13]:
df

     first_name last_name
sdt
0123   Duyen le       huu
1234                  huu
3456        NaN       huu

In [14]:

df.index

Index(['0123', '1234', '3456'], dtype='object', name='sdt')

In [15]:
df.columns

Index(['first_name', 'last_name'], dtype='object')

In [16]:
df.reset_index(inplace=True)

In [17]:
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234                  huu
2  3456        NaN       huu

In [18]:
df["first_name"] == "Duyen le"

0     True
1    False
2    False
Name: first_name, dtype: bool

In [19]:
filt = (df["first_name"] == "Duyen le") | (df["sdt"] == "3456")

In [20]:
df[filt]

    sdt first_name last_name
0  0123   Duyen le       huu
2  3456        NaN       huu

In [21]:
df.loc[~filt,"sdt"]

1    1234
Name: sdt, dtype: object

In [22]:
df.columns

Index(['sdt', 'first_name', 'last_name'], dtype='object')

In [23]:
df.columns = [x.upper() for x in df.columns]
df.columns = [x.lower() for x in df.columns]

df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234                  huu
2  3456        NaN       huu

In [24]:
df.columns = df.columns.str.replace(' ',"_")
df

    sdt first_name last_name
0  0123   Duyen le       huu
1  1234                  huu
2  3456        NaN       huu

In [25]:
df.rename(columns = {"fullname":"full_name","last_name":"middle_name"},inplace =True )

In [26]:
df

    sdt first_name middle_name
0  0123   Duyen le         huu
1  1234                    huu
2  3456        NaN         huu

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.rename(columns={"full_name":"first_name"},inplace = True)

In [29]:
df.loc[0,['full_name','middle_name','first_name']] = ["fullname","middle","first_name"]
df

    sdt  first_name middle_name full_name
0  0123  first_name      middle  fullname
1  1234                     huu       NaN
2  3456         NaN         huu       NaN

In [30]:
filt = (df['sdt'] > "1")

In [31]:
filt

0    False
1     True
2     True
Name: sdt, dtype: bool

In [32]:
df[filt]

    sdt first_name middle_name full_name
1  1234                    huu       NaN
2  3456        NaN         huu       NaN

In [33]:
df.loc[filt,"midde_name"] = "hihi"

In [34]:
df['first_name'] = df['first_name'].str.lower()

In [35]:
df

    sdt  first_name middle_name full_name midde_name
0  0123  first_name      middle  fullname        NaN
1  1234                     huu       NaN       hihi
2  3456         nan         huu       NaN       hihi

In [36]:
 df['sdt'].apply(len)

0    4
1    4
2    4
Name: sdt, dtype: int64

In [37]:
def upperString(first_name):
    return first_name.upper();

In [38]:
df['first_name'] = df['first_name'].apply(upperString)
df

    sdt  first_name middle_name full_name midde_name
0  0123  FIRST_NAME      middle  fullname        NaN
1  1234                     huu       NaN       hihi
2  3456         NAN         huu       NaN       hihi

In [39]:
df['full_name'] = df['midde_name'] = df['first_name'].apply(lambda x : x.upper())
df

    sdt  first_name middle_name   full_name  midde_name
0  0123  FIRST_NAME      middle  FIRST_NAME  FIRST_NAME
1  1234                     huu
2  3456         NAN         huu         NAN         NAN

In [40]:
# df.apply(len,axis ="columns")
# df.apply(len,axis ="rows")

In [41]:
len(df.columns)

5

In [42]:
df.apply(pd.Series.min)

sdt            0123
first_name
middle_name     huu
full_name
midde_name
dtype: object

In [43]:
df.applymap(len)

   sdt  first_name  middle_name  full_name  midde_name
0    4          10            6         10          10
1    4           0            3          0           0
2    4           3            3          3           3

In [44]:
df.apply(len)

sdt            3
first_name     3
middle_name    3
full_name      3
midde_name     3
dtype: int64

In [45]:
df.applymap(str.lower)

    sdt  first_name middle_name   full_name  midde_name
0  0123  first_name      middle  first_name  first_name
1  1234                     huu
2  3456         nan         huu         nan         nan

In [46]:
# map thÃ¬ chá» thay Äá»i key cÃ³ khai bÃ¡o , ko khÃ¡i bÃ¡o sáº½ thÃ nh NAN
# replace thÃ¬ chá» thay Äá»i key cÃ³ khai bÃ¡o , ko khÃ¡i bÃ¡o sáº½ thÃ nh giÃ¡ trá» cÅ©
# df['first_name'] = df['first_name'].map({"first_name":"duyen1",'duyen le':"duyen2"})
df['first_name'] = df['first_name'].replace({"first_name":"duyen1",'duyen le':"duyen2"})

In [47]:
df['first_name'] = df["full_name"].apply(lambda x:x.lower())

In [48]:
df['full_name'] = df['full_name'].replace({"FIRST_NAME":"huu duyen","NAN":"Ha ha"})

In [49]:
df.drop(columns=["midde_name"],inplace=True)

In [50]:
df['full_name'].str.split(" ",expand=True)

     0      1
0  huu  duyen
1        None
2   Ha     ha

In [51]:
df[["first","last"]] = df['full_name'].str.split(" ",expand=True)

In [52]:
df = df.append({"full_name":"Ngoc Tram"},ignore_index=True)

In [53]:
df

    sdt  first_name middle_name  full_name first   last
0  0123  first_name      middle  huu duyen   huu  duyen
1  1234                     huu                    None
2  3456         nan         huu      Ha ha    Ha     ha
3   NaN         NaN         NaN  Ngoc Tram   NaN    NaN

In [54]:
df.loc[3,'first'],df.loc[3,'last'] =df.loc[3,'full_name'].split(" ")

In [55]:
people2 = {
    "full_name":["Duyen le 4","Duyen le 3","Duyen le 4"],
   
    "sdt":["0123","1234","3456"]
}
df2 = pd.DataFrame(people2)

In [56]:
df.append(df2,ignore_index=True,sort = True)

  first  first_name   full_name   last middle_name   sdt
0   huu  first_name   huu duyen  duyen      middle  0123
1                                 None         huu  1234
2    Ha         nan       Ha ha     ha         huu  3456
3  Ngoc         NaN   Ngoc Tram   Tram         NaN   NaN
4   NaN         NaN  Duyen le 4    NaN         NaN  0123
5   NaN         NaN  Duyen le 3    NaN         NaN  1234
6   NaN         NaN  Duyen le 4    NaN         NaN  3456

In [57]:
df

    sdt  first_name middle_name  full_name first   last
0  0123  first_name      middle  huu duyen   huu  duyen
1  1234                     huu                    None
2  3456         nan         huu      Ha ha    Ha     ha
3   NaN         NaN         NaN  Ngoc Tram  Ngoc   Tram

In [58]:
df.drop(index=3,inplace=True)
df

    sdt  first_name middle_name  full_name first   last
0  0123  first_name      middle  huu duyen   huu  duyen
1  1234                     huu                    None
2  3456         nan         huu      Ha ha    Ha     ha

In [59]:
df

    sdt  first_name middle_name  full_name first   last
0  0123  first_name      middle  huu duyen   huu  duyen
1  1234                     huu                    None
2  3456         nan         huu      Ha ha    Ha     ha

In [60]:
filt = (df["middle_name"]=="huu")
filt

0    False
1     True
2     True
Name: middle_name, dtype: bool

df.drop(index=df[filt].index)

In [61]:
#df.loc[filt,"sdt"] =[random.randint(1,10000000) for k in df[filt].index ]
df

    sdt  first_name middle_name  full_name first   last
0  0123  first_name      middle  huu duyen   huu  duyen
1  1234                     huu                    None
2  3456         nan         huu      Ha ha    Ha     ha

In [62]:
[random.randint(1,10000000) for k in df[filt].index ]

[8610303, 3488444]

In [64]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [65]:
df.sort_values(by="sdt",ascending = False)

    sdt  first_name middle_name  full_name first   last
2  3456         nan         huu      Ha ha    Ha     ha
1  1234                     huu                    None
0  0123  first_name      middle  huu duyen   huu  duyen

In [ ]:
df.sort_values(by=["middle_name","sdt"],ascending = [True,False],inplace=True)

In [ ]:
df

In [ ]:
df.sort_index()

In [ ]:
df['sdt'].sort_values()

In [66]:
df['sdt']

0    0123
1    1234
2    3456
Name: sdt, dtype: object

In [71]:
df.set_index('last')

        sdt  first_name middle_name  full_name first
last
duyen  0123  first_name      middle  huu duyen   huu
NaN    1234                     huu
ha     3456         nan         huu      Ha ha    Ha

In [76]:
df.reset_index()

   index   sdt  first_name middle_name  full_name first   last
0      0  0123  first_name      middle  huu duyen   huu  duyen
1      1  1234                     huu                    None
2      2  3456         nan         huu      Ha ha    Ha     ha

In [95]:
df

  first_name last_name sdt
0   Duyen le       huu   1
1                  huu   2
2        NaN       huu   3
3        NaN       huu  18

In [99]:
df.describe()

       first_name last_name sdt
count           4         4   4
unique          3         1   4
top           NaN       huu   3
freq            2         4   1